import React from 'react';
import { Link, useLocation } from 'react-router-dom';

const menuItems = [
    { path: '/about/services_accessibility', label: 'Ծառայությունների հասանելիություն' },
    { path: '/about/reports', label: 'Հաշվետվություններ' },
    { path: '/about/regulatory-framework', label: 'Իրավակարգավորման թերթիկ' },
    { path: '/about/purchases', label: 'Գնումներ' },
    { path: '/about/required-documents', label: 'Անհրաժեշտ փաստաթղթեր' },
];

const AboutSideMenu = () => {
    const location = useLocation();

    return (


        <div className="flex max-w-6xl mx-auto gap-6 sticky top-4">

            <div className="w-1/3 bg-white rounded-2xl shadow-lg p-0">
                <ul className="list-none p-0 m-0">
                    {menuItems.map((item, index) => (
                        <li
                            key={item.path}
                            className={`border-b border-gray-200 last:border-b-0`}
                        >
                            <Link
                                to={item.path}
                                className={`block p-4 text-base font-medium transition-colors duration-200
                                ${location.pathname === item.path ? 'bg-indigo-50 text-indigo-700 font-semibold' : 'text-gray-800 hover:bg-gray-50'}`}
                            >
                                {index + 1}. {item.label}
                            </Link>
                        </li>
                    ))}
                </ul>
            </div>

            <div className="w-2/3 bg-white rounded-2xl shadow-lg p-6 overflow-y-auto max-h-[90vh] text-gray-700 text-sm leading-relaxed">
                <h2 className="text-xl font-semibold mb-4">Մեր մասին</h2>
                <p>
                    «ՋԻԷՆՍԻ-ԱԼՖԱ» ՓԲԸ-ն հիմնադրվել է 2007 թ․-ին։ OVIO-ն («ՋԻԷՆՍԻ-ԱԼՖԱ» ՓԲԸ), հանդիսանալով ՀՀ հեռահաղորդակցության ոլորտի առաջատար օպերատորներից մեկը, 2012թ․ սկսած մատուցում է լայնաշերտ ինտերնետի, թվային հեռուստատեսության և օնլայն կինոթատրոնի, Ֆիքսված հեռախոսակապի ծառայություններ և մի շարք ամպային լուծումներ։
                </p>
                <p className="mt-2">
                    Ընկերության մուտքը հայաստանյան հեռահաղորդակցության ոլորտ հատկանշական էր ցանցի զարգացման ուղղությամբ խոշոր ներդրումներով, ինչի արդյունքում հաջողությամբ գործարկվեց «օպտիկան յուրաքանչյուր բնակարանում» (GPON) տեխնոլոգիան հայաստանյան մի շարք քաղաքներում։
                </p>
                <p className="mt-2">
                    Ընկերության ցանցը հիմնված է օպտիկամանրաթելային ենթակառուցվածքի վրա և կառուցված է ստորգետնյա տեղակայման եղանակով՝ միացնելով Հայաստանը արտաքին աշխարհի հետ Վրաստանի և Իրանի սահմաններով: OVIO-ն ապահովված է երեք միջազգային կապուղիներով դեպի Ռուսաստան և Եվրոպա, որոնք միմյանցից ֆիզիկապես և աշխարհագրորեն տարանջատված են՝ երաշխավորելով ընկերության հուսալի և անխափան ծառայությունների մատուցումը:
                </p>
                <p className="mt-2">
                    OVIO-ի ցանցը Հայաստանում եզակի է իր կառուցվածքային հնարավորություններով և առավելություններով՝
                    <ul className="list-disc list-inside mt-1 ml-4">
                        <li>տվյալների հաղորդման օպտիկական համակարգեր</li>
                        <li>ավելին քան 3000 կմ երկարություն</li>
                        <li>92% ներկայություն ՀՀ քաղաքներում</li>
                        <li>համացանցին միանալու հնարավորություն մինչև 200 ԳԲ/վ արագությամբ</li>
                    </ul>
                </p>
                <p className="mt-2">
                    OVIO-ի օպտիկամանրաթելային մալուխը և նրա միջոցով մատուցվող որակյալ և նորարական ծառայությունները հասանելի են Երևան, Աբովյան, Չարենցավան, Հրազդան, Վանաձոր, Գյումրի, Աշտարակ, Մեծամոր, Արմավիր, Մասիս, Արարատ, Արտաշատ, Սևան, Դիլիջան, Իջևան, Կապան, Մարտունի, Ալավերդի և Քաջարան քաղաքների բնակիչների համար։
                </p>
                <p className="mt-2">
                    OVIO-ի կորպորատիվ հաճախորդների թվում են հայաստանյան բազմաթիվ խոշոր ձեռնարկություններ, այդ թվում բանկեր և այլ ֆինանսական կառույցներ, պետական գերատեսչություններ, հեռահաղորդակցության ընկերություններ և միջազգային խոշոր կազմակերպություններ։
                </p>
                <p className="mt-2">
                    2023թ․ մարտին ընկերությունը սկսել և 2024թ․-ի մայիսին կոմերցիոն շահագործման է հանձնել Հայաստանում խոշորագույն և ամենահզոր տվյալների մշակման կենտրոնի նախագիծը Կոտայքի մարզում՝ քաղաք Աբովյանում։
                </p>
                <p className="mt-2">
                    Հաշվի առնելով երկրի համար ռազմավարական նշանակությունը՝ ընկերության կողմից կառուցվող տվյալների մշակման կենտրոնի ներդրումային ծրագիրն արժանացել է ՀՀ Կառավարության հավանությանը և ներառվել ՀՀ Էկոնոմիկայի նախարարության՝ «Ենթակառուցվածքներ ներդրումների դիմաց» ծրագրում։
                </p>
                <p className="mt-2">
                    Տվյալների մշակման կենտրոնի հզորությունը 2 ՄՎտ է, և այն միացված է ՀՀ էներգոհամակարգին 35 կՎտ և 110 կՎտ հզորությամբ իրարից անկախ սնուցվող 2 ենթակայաններով և ապահովված է Mitsubishi մակնիշի երկու դիզելային գեներատորներով, որոնք երաշխավորում են կենտրոնի անխափան աշխատանքը։
                </p>
                <p className="mt-2">
                    Կենտրոնը կառուցված  է ISO 27001, ISO 27017, ISO 27018, PCI DSS և Tier III միջազգային հեղինակավոր սերտիֆիկատների չափանիշներով։ OVIO-ի տվյալների մշակման կենտրոնում տեղակայված են 216 սերվերային պահարաններ։
                </p>
                <p className="mt-2">
                    Տվյալների մշակման կենտրոնում ընկերությունն առաջարկում է համատեղակայման ծառայություներ և ամպային լուծումներ, որոնք առանցքային տեղ են զբաղեցնում ընկերության առաջարկների մեջ և նպատակ ունեն վերափոխելու և արդիականացնելու ՀՀ-ում տեղեկատվական տեխնոլոգիաների ոլորտը։
                </p>
                <p className="mt-2">
                    Հավատարիմ մնալով բաժանորդներին որակյալ և նորարարական տեխնոլոգիաներ տրամադրելու իր հանձնառությանը՝ OVIO-ն 2023թ-ից սկսած ներդրել է Wink թվային հեռուստատեսության և օնլայն կինոթատրոնի ինտերակտիվ հարթակն իր բազմաթիվ ֆունկցիոնալ հնարավորություններով, 180-ից ավելի հեռուստաալիքներով և ավելի քան 50 000 ֆիլմեր և սերիալներ պարունակող ֆիլմադարանով։
                </p>
                <p className="mt-2">
                    OVIO-ի հիմնարար արժեքներից են բաց և թափանցիկ գործելաոճը՝ ապահովելու համար պարզ և հարմարավետ փորձառություն հաճախորդների և գործընկերների համար։
                    <ul className="list-disc list-inside mt-1 ml-4">
                        <li>պրոֆեսիոնալիզմ: բարձրորակ ծառայությունները և բացառիկ սպասարկումը պահանջում են բարձրակարգ մասնագետներ, և ընկերությունը երաշխավորում է, որ իր թիմը բաղկացած է միայն լավագույն մասնագետներից</li>
                        <li>հարգանք: յուրաքանչյուր հաճախորդ գիտի, որ OVIO-ն ճանաչում է իր նախասիրությունները և պահանջները։ Գիտակցելով, որ հաճախորդն արժանի է առավելագույնի՝ ընկերությունը ձգտում է ապահովել լավագույն փորձ</li>
                        <li>ներգրավվածություն: OVIO-ի յուրաքանչյուր աշխատակից տարված է իր աշխատանքով: Անձնակազմի յուրաքանչյուր անդամ հասկանում է, թե ինչպես պլանավորի իր աշխատանքը, որպեսզի արդարացվեն յուրաքանչյուր հաճախորդի սպասելիքները</li>
                        <li>հոգատարություն: ընկերությունը ճանաչվել է լավագույններից մեկը ոլորտում ոչ պատահական, այլ նվիրված աշխատանքի շնորհիվ: Մենք ձգտում ենք լուծել խնդիրները մինչև դրանց ի հայտ գալը, քանի որ մեզ համար հաճախորդի հանդեպ հոգատարությունը ավելին է, քան պարզապես արտահայտություն</li>
                    </ul>
                </p>
                <p className="mt-2">
                    OVIO-ն հավատարիմ է մնում հուսալի և որակյալ ծառայություններ մատուցելու և նորարարական լուծումներ տրամադրելու իր հանձնառությանը, որի կենտրոնում հաճախորդի գոհունակությունն է: Ընկերությունը դուրս է եկել հեռահաղորդակցության դասական օպերատոր լինելու սահմաններից՝ վերափոխվելով և մատուցելով մի շարք թվային ու ամպային ծառայություններ՝ որպես մեկ միասնական էկոհամակարգ։
                </p>
            </div>

        </div>
    );
};

export default AboutSideMenu;